RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_adc_sar.c
static uint8_t _cyhal_adc_get_block_from_irqn(_cyhal_system_irq_t irqn)
{
    switch (irqn)
    {
#if (CY_CPU_CORTEX_M4 || CY_IP_M0S8PASS4A_SAR_INSTANCES) // M0S8 only has one processor, a CM0 variant
#if defined(_CYHAL_ADC_SINGLE_UNSUFFIXED)
    case pass_interrupt_sar_IRQn:
        return 0;
#elif (CY_IP_M0S8PASS4A_SAR_INSTANCES == 1)
    case pass_0_interrupt_sar_IRQn:
        return 0;
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 1)
    case pass_interrupt_sar_0_IRQn:
        return 0;
#elif (CY_IP_MXS40PASS_SAR_INSTANCES == 2)
    case pass_interrupt_sar_0_IRQn:
        return 0;
    case pass_interrupt_sar_1_IRQn:
        return 1;
#elif (CY_IP_M0S8PASS4A_SAR_INSTANCES == 2)
    case pass_0_interrupt_sar_IRQn:
        return 0;
    case pass_1_interrupt_sar_IRQn:
        return 1;
#else
    #warning "Unhandled SAR instance count"
#endif
#endif /* (CY_CPU_CORTEX_M4 || CY_IP_M0S8PASS4A_SAR_INSTANCES) */
    default:
        CY_ASSERT(false); // Should never be called with a non-SAR IRQn
        return 0;
    }
}

#if defined(CY_IP_MXS40PASS_SAR_INSTANCES)
/* OR in the following user-configurable values: vref, bypass, vneg, */
#define _CYHAL_ADC_DEFAULT_CTRL ((uint32_t)CY_SAR_VREF_PWR_100 | (uint32_t)CY_SAR_VREF_SEL_BGR \
                                | (uint32_t)CY_SAR_BYPASS_CAP_DISABLE | (uint32_t)CY_SAR_CTRL_NEGVREF_HW \
                                | (uint32_t)CY_SAR_CTRL_COMP_DLY_12   | (uint32_t)CY_SAR_COMP_PWR_100 \
                                | (uint32_t)CY_SAR_DEEPSLEEP_SARMUX_OFF | (uint32_t)CY_SAR_SARSEQ_SWITCH_ENABLE)

/* Default configuration. OR in the average count, and average mode */
#define _CYHAL_ADC_DEFAULT_SAMPLE ((uint32_t)CY_SAR_RIGHT_ALIGN | (uint32_t)CY_SAR_TRIGGER_MODE_FW_ONLY \
                                 | (uint32_t)CY_SAR_SINGLE_ENDED_SIGNED | (uint32_t)CY_SAR_DIFFERENTIAL_SIGNED \
                                 | (uint32_t)CY_SAR_TRIGGER_MODE_FW_ONLY)

static const cy_stc_sar_config_t _CYHAL_ADC_DEFAULT_PDL_CONFIG =
{
    /* .ctrl is populated from _CYHAL_ADC_DEFAULT_CTRL plus the user's configuration */
    /* .sampleCtrl is puopulated from _CYHAL_ADC_DEFAULT_SAMPLE plus the user's configuration */
    .sampleTime01 = (10UL << SAR_SAMPLE_TIME01_SAMPLE_TIME0_Pos), // Sample times 1, 2, and 3 are not used
    .sampleTime23 = 0UL,
    .rangeThres = (0UL << CY_SAR_RANGE_HIGH_SHIFT) | (0UL << CY_SAR_RANGE_LOW_SHIFT),
    .rangeCond = CY_SAR_RANGE_COND_BELOW,
    .chanEn = 0UL,
    .chanConfig = { 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL},
    .intrMask = (uint32_t) CY_SAR_INTR_EOS,
    .satIntrMask = 0UL,
    .rangeIntrMask = 0UL,
    .muxSwitch = 0UL,
    .muxSwitchSqCtrl = 0UL,
    .configRouting = true,
    /* .vrefMvValue is populated from the user's configuration */
};

#endif

#define _CYHAL_ADC_RESOLUTION 12u
#define _CYHAL_ADC_INTERNAL_VREF_MV 1200UL
#define _CYHAL_ADC_CONVERSION_CYCLES (_CYHAL_ADC_RESOLUTION + 2)

static const cyhal_adc_config_t _CYHAL_ADC_DEFAULT_CONFIG =
{
    .resolution          = _CYHAL_ADC_RESOLUTION,
    .average_count       = 1,
    .average_mode_flags  = CYHAL_ADC_AVG_MODE_AVERAGE,
    .continuous_scanning = true,
    .vneg                = CYHAL_ADC_VNEG_VREF,
    .vref                = CYHAL_ADC_REF_INTERNAL,
    .ext_vref            = NC,
    .ext_vref_mv         = 0u,
    .is_bypassed         = false,
    .bypass_pin          = NC,
};

/*******************************************************************************
*       Internal helper functions
*******************************************************************************/
static void _cyhal_adc_update_intr_mask(const cyhal_adc_t* obj)
{
    bool needs_eos = (obj->async_scans_remaining > 0) /* Async transfer in progress */
                    || (false == obj->conversion_complete) /* ISR needs to flag that a conversion finished */
                    || obj->stop_after_scan /* ISR needs to stop the conversion after the scan finishes */
                    || (0u != (CYHAL_ADC_EOS & obj->user_enabled_events)); /* User requested EOS event */

    uint32_t current_mask = Cy_SAR_GetInterruptMask(obj->base);
    uint32_t new_mask;
    if(needs_eos)
    {
        new_mask = current_mask | CY_SAR_INTR_EOS;
    }
    else
    {
        new_mask = current_mask & ~CY_SAR_INTR_EOS;
    }

    Cy_SAR_ClearInterrupt(obj->base, new_mask & (~current_mask));
    Cy_SAR_SetInterruptMask(obj->base, new_mask);
}

static uint8_t _cyhal_adc_max_configured_channel(const cyhal_adc_t* obj)
{
    uint8_t max = 0;
    for(uint8_t i = 0; i < CY_SAR_SEQ_NUM_CHANNELS; ++i)
    {
        if(NULL != obj->channel_config[i])
        {
            max = i;
        }
    }
    return max;
}

static uint32_t _cyhal_adc_get_mux_switch_control(cyhal_gpio_t gpio)
{
    static const uint32_t mux_lookup[] =
    {
#if defined(CY_IP_M0S8PASS4A_SAR_INSTANCES)
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P0_Msk,
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P1_Msk,
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P2_Msk,
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P3_Msk,
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P4_Msk,
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P5_Msk,
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P6_Msk,
        SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P7_Msk,
#else
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P0,
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P1,
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P2,
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P3,
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P4,
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P5,
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P6,
        (uint32_t)CY_SAR_MUX_SQ_CTRL_P7
#endif
    };
    uint8_t pin = CYHAL_GET_PIN(gpio);
    CY_ASSERT(pin < sizeof(mux_lookup)/sizeof(mux_lookup[0]));
    return mux_lookup[pin];
}

static uint32_t _cyhal_adc_get_fw_switch_control(cyhal_gpio_t gpio, bool is_vplus)
{
    static const uint32_t vplus_lookup[] =
    {
        (uint32_t)CY_SAR_MUX_FW_P0_VPLUS,
        (uint32_t)CY_SAR_MUX_FW_P1_VPLUS,
        (uint32_t)CY_SAR_MUX_FW_P2_VPLUS,
        (uint32_t)CY_SAR_MUX_FW_P3_VPLUS,
        (uint32_t)CY_SAR_MUX_FW_P4_VPLUS,
        (uint32_t)CY_SAR_MUX_FW_P5_VPLUS,
        (uint32_t)CY_SAR_MUX_FW_P6_VPLUS,
        (uint32_t)CY_SAR_MUX_FW_P7_VPLUS
    };

    static const uint32_t vminus_lookup[] =
    {
        (uint32_t)CY_SAR_MUX_FW_P0_VMINUS,
        (uint32_t)CY_SAR_MUX_FW_P1_VMINUS,
        (uint32_t)CY_SAR_MUX_FW_P2_VMINUS,
        (uint32_t)CY_SAR_MUX_FW_P3_VMINUS,
        (uint32_t)CY_SAR_MUX_FW_P4_VMINUS,
        (uint32_t)CY_SAR_MUX_FW_P5_VMINUS,
        (uint32_t)CY_SAR_MUX_FW_P6_VMINUS,
        (uint32_t)CY_SAR_MUX_FW_P7_VMINUS
    };

