RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_adc_sar.c
#if defined(CY_IP_M0S8PASS4A_INSTANCES)
    cy_stc_sar_channel_config_t chan_configs[CY_SAR_SEQ_NUM_CHANNELS];
    memset(chan_configs, 0, sizeof(chan_configs));
    // No channels have actually been configured yet, so an empty set of config structs is fine here
    cy_rslt_t result =  _cyhal_adc_populate_pdl_config(&_CYHAL_ADC_DEFAULT_CONFIG, &pdl_config, chan_configs);
#else
    cy_rslt_t result = _cyhal_adc_populate_pdl_config(&_CYHAL_ADC_DEFAULT_CONFIG, &pdl_config);
#endif

    if (CY_RSLT_SUCCESS == result)
    {
        cyhal_adc_configurator_t config;
        config.resource = NULL;
        config.config = &pdl_config;
        config.clock = clk;
        config.num_channels = 0u;

        result = _cyhal_adc_config_hw(obj, &config, pin, false);
    }
    return result;
}

void cyhal_adc_free(cyhal_adc_t *obj)
{
    if (NULL != obj && NULL != obj->base)
    {
        _cyhal_system_irq_t irqn = _cyhal_adc_irq_n[obj->resource.block_num];
        _cyhal_irq_free(irqn);
        _cyhal_adc_config_structs[obj->resource.block_num] = NULL;

        cy_rslt_t rslt;
        rslt = cyhal_adc_disable_output(obj, CYHAL_ADC_OUTPUT_SCAN_COMPLETE);
        CY_ASSERT(CY_RSLT_SUCCESS == rslt);
        if (CYHAL_TRIGGER_CPUSS_ZERO != obj->source)
        {
            rslt = cyhal_adc_disconnect_digital(obj, obj->source, CYHAL_ADC_INPUT_START_SCAN);
            CY_ASSERT(CY_RSLT_SUCCESS == rslt);
        }
        (void)rslt; // Disable compiler warning in release build

        Cy_SAR_SetVssaSarSeqCtrl(obj->base, _CYHAL_ADC_SARSEQ_STATE(false));
        Cy_SAR_SetVssaVminusSwitch(obj->base, _CYHAL_ADC_SWITCH_STATE(false));

        Cy_SAR_StopConvert(obj->base);

        if(false == obj->owned_by_configurator)
        {
            Cy_SAR_Disable(obj->base);

            if(obj->dedicated_clock)
            {
                _cyhal_utils_peri_pclk_disable_divider(_cyhal_adc_clock[obj->resource.block_num], &(obj->clock));
                cyhal_clock_free(&obj->clock);
            }

            _cyhal_analog_free();
#if defined(CY_IP_M0S8PASS4A_SAR_INSTANCES)
            _cyhal_utils_release_if_used(&(obj->ext_vref));
            _cyhal_utils_release_if_used(&(obj->bypass_pin));
#endif
            cyhal_hwmgr_free(&obj->resource);
        }
        obj->base = NULL;
    }
}

cy_rslt_t _cyhal_adc_populate_acquisition_timers(cyhal_adc_t* obj)
{
    const uint32_t ACQUISITION_CLOCKS_MIN = 2;
    const uint32_t ACQUISITION_CLOCKS_MAX = 1023;

    cy_rslt_t result = CY_RSLT_SUCCESS;

    uint32_t clock_frequency_hz = cyhal_clock_get_frequency(&(obj->clock));
    uint32_t clock_period_ns = (clock_frequency_hz > 0)
        ? (_CYHAL_UTILS_NS_PER_SECOND / clock_frequency_hz)
        : 0;
    uint16_t sample_timer_ns[] = { 0u, 0u, 0u, 0u };
    uint8_t assigned_timer[CY_SAR_SEQ_NUM_CHANNELS];
    if (clock_period_ns == 0)
    {
        result = CYHAL_ADC_RSLT_FAILED_CLOCK;
    }
    if (result == CY_RSLT_SUCCESS)
    {
        for(uint8_t channel = 0; channel < CY_SAR_SEQ_NUM_CHANNELS; ++channel)
        {
            cyhal_adc_channel_t* chan_config = obj->channel_config[channel];
            assigned_timer[channel] = 0u;
            /* If the channel isn't in use, what we select doesn't matter */
            if(NULL != chan_config)
            {
                bool found = false;
                for(uint8_t timer = 0; timer < sizeof(sample_timer_ns) / sizeof(sample_timer_ns[0]); ++timer)
                {
                    if(chan_config->minimum_acquisition_ns == sample_timer_ns[timer])
                    {
                        /* Matched a pre-existing timer; use that */
                        assigned_timer[channel] = timer;
                        found = true;
                        break;
                    }
                    else if(0 == sample_timer_ns[timer])
                    {
                        /* Found a free timer - allocate and use that */
                        sample_timer_ns[timer] = chan_config->minimum_acquisition_ns;
                        assigned_timer[channel] = timer;
                        found = true;
                        break;
                    }
                }

                if(false == found)
                {
                    /* Ran out of acquisition timers */
                    result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
                }
            }
        }
    }

    if(CY_RSLT_SUCCESS == result)
    {
        uint16_t sample_timer_clocks[sizeof(sample_timer_ns) / sizeof(sample_timer_ns[0])];
        for(uint8_t i = 0; i < sizeof(sample_timer_clocks) / sizeof(sample_timer_clocks[0]); ++i)
        {
            /* Convert from nanoseconds to clock cycles, rounding up */
            uint32_t clock_cycles = (sample_timer_ns[i] + (clock_period_ns - 1)) / clock_period_ns;
            if(clock_cycles < ACQUISITION_CLOCKS_MIN)
            {
                clock_cycles = ACQUISITION_CLOCKS_MIN;
            }
            else if(clock_cycles > ACQUISITION_CLOCKS_MAX)
            {
                clock_cycles = ACQUISITION_CLOCKS_MAX;
            }
            /* Per the register map, this should be one greater than the actual desired sampling cycle count */
            sample_timer_clocks[i] = clock_cycles + 1;
        }

        obj->base->SAMPLE_TIME01 = (uint32_t) (((uint32_t)sample_timer_clocks[0] << SAR_SAMPLE_TIME01_SAMPLE_TIME0_Pos)
                                 | ((uint32_t)sample_timer_clocks[1] << SAR_SAMPLE_TIME01_SAMPLE_TIME1_Pos));
        obj->base->SAMPLE_TIME23 = (uint32_t) (((uint32_t)sample_timer_clocks[2] << SAR_SAMPLE_TIME23_SAMPLE_TIME2_Pos)
                                 | ((uint32_t)sample_timer_clocks[3] << SAR_SAMPLE_TIME23_SAMPLE_TIME3_Pos));

        for(uint8_t i = 0; i < CY_SAR_SEQ_NUM_CHANNELS; ++i)
        {
            obj->base->CHAN_CONFIG[i] &= ~SAR_CHAN_CONFIG_SAMPLE_TIME_SEL_Msk;
            obj->base->CHAN_CONFIG[i] |= (uint32_t)assigned_timer[i] << SAR_CHAN_CONFIG_SAMPLE_TIME_SEL_Pos;
        }
    }

    return result;
}


cy_rslt_t cyhal_adc_configure(cyhal_adc_t *obj, const cyhal_adc_config_t *config)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

#if defined(CYHAL_PIN_MAP_DRIVE_MODE_PASS_SAR_EXT_VREF0)
    if(NC != config->ext_vref)
    {
        // If this pin wasn't used in the previous config for either vref or bypass, reserve it
        if((NC == obj->ext_vref) && (config->ext_vref != obj->bypass_pin))
        {
            const cyhal_resource_pin_mapping_t* ext_vref_map =
                _cyhal_utils_get_resource(config->ext_vref, cyhal_pin_map_pass_sar_ext_vref0,
                    sizeof(cyhal_pin_map_pass_sar_ext_vref0)/sizeof(cyhal_pin_map_pass_sar_ext_vref0[0]), &(obj->resource),
                    false);

            if (NULL == ext_vref_map)
            {
                result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
            }
            else
            {
                result = _cyhal_utils_reserve_and_connect(ext_vref_map, CYHAL_PIN_MAP_DRIVE_MODE_PASS_SAR_EXT_VREF0);
            }

            if(CY_RSLT_SUCCESS == result)
            {
                obj->ext_vref = config->ext_vref;
            }
        }
    }
    else
    {
        if(NC != obj->ext_vref) // We used to have an external vref pin - free it
        {
            // If the same pin was used as bypass, mark it freed now too
            if(obj->ext_vref == obj->bypass_pin)
            {
                obj->bypass_pin = NC;
            }
            // It is okay to do this without checking if the pin is still used for bypass,
            // because in that case we will just re-reserve the pin below
            cyhal_gpio_free(obj->ext_vref);
            obj->ext_vref = NC;
        }

        // If external vref exists as a GPIO, it's an error to set vref to external without passing in the pin
        if(CYHAL_ADC_REF_EXTERNAL == config->vref)
        {
            result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
        }
    }

    if(NC != config->bypass_pin)
    {
        if(CY_RSLT_SUCCESS == result)
        {
            // Bypass and ext_vref share the same hard-wired IO connection
            const cyhal_resource_pin_mapping_t* bypass_map =
                _cyhal_utils_get_resource(config->bypass_pin, cyhal_pin_map_pass_sar_ext_vref0,
                    sizeof(cyhal_pin_map_pass_sar_ext_vref0)/sizeof(cyhal_pin_map_pass_sar_ext_vref0[0]), &(obj->resource),
                    false);

            if (NULL == bypass_map)
            {
                result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
            }
            else if(config->bypass_pin != config->ext_vref) // It's valid to use the same pin for both ext_vref and bypass
            {
                result = _cyhal_utils_reserve_and_connect(bypass_map, CYHAL_PIN_MAP_DRIVE_MODE_PASS_SAR_EXT_VREF0);
            }
        }

        if(CY_RSLT_SUCCESS == result)
        {
            obj->bypass_pin = config->bypass_pin;
        }
    }
    else
    {
        // We used to have an external vref pin - free it, unless it's still used for ext_vref
        if((NC != obj->bypass_pin) && (obj->ext_vref != obj->bypass_pin))
        {
            cyhal_gpio_free(obj->bypass_pin);
            obj->bypass_pin = NC;
        }

        // If bypass exists as a GPIO, it's an error to enable bypass without passing in the pin
        if(config->is_bypassed)
        {
            result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
        }
    }
#else
    /* No GPIO pins for VREF - it must be using a dedicated pad */
    if(config->bypass_pin != NC || config->ext_vref != NC)
    {
        result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
    }
#endif

    if(false == ((CYHAL_ADC_REF_EXTERNAL == config->vref) ^ (0u == config->ext_vref_mv)))
    {
        /* Must have exactly one of: ext vref selected, ext vref voltage unspecified */
        result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
    }

    cy_stc_sar_config_t pdl_config;
#if defined(CY_IP_M0S8PASS4A_SAR_INSTANCES)
    if(CY_RSLT_SUCCESS == result)
    {
        obj->resolution = config->resolution;
        cy_stc_sar_channel_config_t chan_configs[CY_SAR_SEQ_NUM_CHANNELS];
        _cyhal_adc_extract_channel_conf(obj, chan_configs);
        result = _cyhal_adc_populate_pdl_config(config, &pdl_config, chan_configs);
    }
#else
    if(CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_adc_populate_pdl_config(config, &pdl_config);
    }
#endif

    if(CY_RSLT_SUCCESS == result)
    {
        /* Save and restore channel configs */
        pdl_config.chanEn = obj->base->CHAN_EN;

        /* Don't deinit routing or change the channel config - we're going
         * to turn the SAR back on in a minute */
#if defined(CY_IP_M0S8PASS4A_SAR_INSTANCES)
        pdl_config.routingConfig = NULL;
#else
        pdl_config.configRouting = false;
        /* On M0S8 we already extracted the channel configuration as part
         * of assembling the PDL config struct. On MxS40 we need to do it here */
        for(uint8_t i = 0; i < CY_SAR_SEQ_NUM_CHANNELS; ++i)
        {
            pdl_config.chanConfig[i] = obj->base->CHAN_CONFIG[i];
        }
#endif
        Cy_SAR_Disable(obj->base);
        Cy_SAR_DeInit(obj->base, false);
        result = (cy_rslt_t)Cy_SAR_Init(obj->base, &pdl_config);
        _cyhal_adc_populate_acquisition_timers(obj);
        Cy_SAR_SetInterruptMask(obj->base, CY_SAR_INTR_EOS);
        Cy_SAR_Enable(obj->base);
    }

    obj->continuous_scanning = config->continuous_scanning;
    if(obj->continuous_scanning)
    {
        obj->conversion_complete = false;
        _cyhal_adc_update_intr_mask(obj);
        Cy_SAR_StartConvert(obj->base, CY_SAR_START_CONVERT_CONTINUOUS);
    }
    return result;
}

cy_rslt_t cyhal_adc_set_power(cyhal_adc_t *obj, cyhal_power_level_t power)
{
    // The SAR doesn't have selectable power levels in the same way that the opamps do.
    if(CYHAL_POWER_LEVEL_OFF == power)
    {
        Cy_SAR_Disable(obj->base);
    }
    else
    {
        Cy_SAR_Enable(obj->base);
    }
    return CY_RSLT_SUCCESS;
}

static uint16_t _cyhal_adc_get_average_count(cyhal_adc_t* obj, int channel_idx)
{
    uint32_t average_count = 1;
    /* If averaging is in interleaved mode, it does not impact the sample time */
#if defined(CY_IP_MXS40PASS_SAR_INSTANCES)
    bool is_interleaved = CY_SAR_AVG_MODE_INTERLEAVED == (SAR_SAMPLE_CTRL(obj->base) & SAR_SAMPLE_CTRL_AVG_MODE_Msk);
#else
    bool is_interleaved = false;
#endif

    if(false == is_interleaved)
    {
        average_count = (SAR_SAMPLE_CTRL(obj->base) & SAR_SAMPLE_CTRL_AVG_CNT_Msk) >> SAR_SAMPLE_CTRL_AVG_CNT_Pos;
        average_count = (1uL << (average_count + 1uL));
    }

    return (obj->base->CHAN_CONFIG[channel_idx] & SAR_CHAN_CONFIG_AVG_EN_Msk) ? average_count : 1;
}

/* Gets acquisition times and conversion clocks for all enabled channels, factoring in averaging */
static void _cyhal_adc_get_sample_times(cyhal_adc_t* obj, uint32_t* min_acquisition_ns, uint32_t* conversion_clock_cycles)
{
    *min_acquisition_ns = *conversion_clock_cycles = 0;
    for(uint8_t i = 0; i < CY_SAR_SEQ_NUM_CHANNELS; ++i)
    {
        cyhal_adc_channel_t* chan_config = obj->channel_config[i];
        if((NULL != chan_config) && (0u != (obj->base->CHAN_EN & ((uint32_t)1U << i))))
        {
            uint32_t min_time = chan_config->minimum_acquisition_ns;
            uint8_t clock_cycles = _CYHAL_ADC_CONVERSION_CYCLES;
            uint16_t average_count = _cyhal_adc_get_average_count(obj, i);
            min_time *= average_count;
            clock_cycles *= average_count;

            *min_acquisition_ns += min_time;
            *conversion_clock_cycles += clock_cycles;
        }
    }
}

uint32_t _cyhal_adc_calc_optimal_clock_rate(cyhal_adc_t* obj, uint32_t target_sample_hz)
{
    /* From the architecture TRM */
    const uint32_t ADC_CLOCK_MAX_HZ = 60000000;
    const uint32_t ADC_CLOCK_MIN_HZ = 1000000;

