RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_adc_sar.c
        obj->adc->base->CHAN_CONFIG[obj->channel_idx] = 0;
        obj->adc = NULL;
    }
}

uint16_t cyhal_adc_read_u16(const cyhal_adc_channel_t *obj)
{
#if defined(CY_IP_M0S8PASS4A_SAR_INSTANCES)
    const uint8_t RESULT_SCALING_FACTOR = UINT16_MAX / ((1 << obj->adc->resolution) - 1); // 12-bit SAR resolution
#else
    const uint8_t RESULT_SCALING_FACTOR = UINT16_MAX / 0xFFF; // constant 12-bit SAR resolution
#endif
    int32_t signed_result = cyhal_adc_read(obj);
    /* Legacy API for BWC. Convert from signed to unsigned by adding 0x800 to
     * convert the lowest signed 12-bit number to 0x0.
     */
    uint16_t unsigned_result = (uint16_t)(signed_result + 0x800);
    /* The SAR provides a 12-bit result, but this API is defined to fill a full 16-bit range */
    uint16_t scaled_result = unsigned_result * RESULT_SCALING_FACTOR;
    return scaled_result;
}

int32_t cyhal_adc_read(const cyhal_adc_channel_t *obj)
{
    uint32_t old_en_mask = 0u;

#if defined(CY_IP_MXS40PASS_SAR_INSTANCES)
    bool isInterleaved = (CY_SAR_AVG_MODE_INTERLEAVED == (SAR_SAMPLE_CTRL(obj->adc->base) & SAR_SAMPLE_CTRL_AVG_MODE_Msk));
#else
    bool isInterleaved = false;
#endif
    bool isChannelAveraging = (obj->adc->base->CHAN_CONFIG[obj->channel_idx] & SAR_CHAN_CONFIG_AVG_EN_Msk);
    if(!obj->adc->continuous_scanning)
    {
        /* Enable the selected channel only, then perform an on-demand conversion.
         * Save the old enabled channel set to restore after we're done */
        bool isChannelInterleaved = (isInterleaved && isChannelAveraging);
        old_en_mask = SAR_CHAN_EN(obj->adc->base);
        Cy_SAR_SetChanMask(obj->adc->base, (uint32_t) (1U << obj->channel_idx));
        obj->adc->conversion_complete = false;
        obj->adc->stop_after_scan = isChannelInterleaved;
        _cyhal_adc_update_intr_mask(obj->adc);

        // If interleaved averaging and average is enabled for this channel, set for
        // continuous scanning and then stop the scan once we get a result. This is
        // because the ADC hardware has a special case where it will not raise
        // the EOC interrupt until AVG_COUNT scans have occurred when all enabled
        // channels are using interleaved channels. This means that for the first AVG_COUNT - 1
        // scans there will be no interrupt, therefore conversion_complete will never
        // be set true, and therefore the loop below would be stuck waiting forever,
        // never able to trigger a subsequent scan.
        Cy_SAR_StartConvert(obj->adc->base, (isChannelInterleaved) ? CY_SAR_START_CONVERT_CONTINUOUS : CY_SAR_START_CONVERT_SINGLE_SHOT);
    }

    /* Cy_SAR_IsEndConversion relies on and clears the EOS interrupt status bit.
     * We don't know how this read will be used in combination with interrupts,
     * so implement our own interrupt-driven EOS flag
     */
    while(!obj->adc->conversion_complete) { }

    int32_t result = Cy_SAR_GetResult32(obj->adc->base, obj->channel_idx);

    if(!obj->adc->continuous_scanning)
    {
        Cy_SAR_SetChanMask(obj->adc->base, old_en_mask);
    }

    return result;
}

int32_t cyhal_adc_read_uv(const cyhal_adc_channel_t *obj)
{
    CY_ASSERT(NULL != obj);

    int32_t counts = cyhal_adc_read(obj);
    return Cy_SAR_CountsTo_uVolts(obj->adc->base, obj->channel_idx, counts);
}

void _cyhal_adc_start_async_read(cyhal_adc_t* obj, size_t num_scan, int32_t* result_list)
{
    CY_ASSERT(NULL == obj->async_buff_next); /* Transfer already in progress */
    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    obj->async_scans_remaining = num_scan;
    obj->async_buff_next = obj->async_buff_orig = result_list;
    _cyhal_adc_update_intr_mask(obj);

    if(false == obj->continuous_scanning)
    {
        Cy_SAR_StartConvert(obj->base, CY_SAR_START_CONVERT_SINGLE_SHOT);
    }
    cyhal_system_critical_section_exit(savedIntrStatus);
}

cy_rslt_t cyhal_adc_read_async(cyhal_adc_t* obj, size_t num_scan, int32_t* result_list)
{
    CY_ASSERT(NULL != obj);
    obj->async_transfer_in_uv = false;
    _cyhal_adc_start_async_read(obj, num_scan, result_list);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_adc_read_async_uv(cyhal_adc_t* obj, size_t num_scan, int32_t* result_list)
{
    CY_ASSERT(NULL != obj);
    obj->async_transfer_in_uv = true;
    _cyhal_adc_start_async_read(obj, num_scan, result_list);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_adc_set_async_mode(cyhal_adc_t *obj, cyhal_async_mode_t mode, uint8_t dma_priority)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL == obj->async_buff_next); /* Can't swap mode while a transfer is running */

    cy_rslt_t result = CY_RSLT_SUCCESS;

    if(mode == CYHAL_ASYNC_DMA)
    {
#if defined(CY_IP_M0S8CPUSSV3_DMAC) || defined(CY_IP_M4CPUSS_DMA) || defined(CY_IP_M4CPUSS_DMAC)
        result = cyhal_dma_init(&(obj->dma), CYHAL_DMA_PRIORITY_DEFAULT, CYHAL_DMA_DIRECTION_PERIPH2MEM);
        if(CY_RSLT_SUCCESS == result)
        {
            cyhal_dma_register_callback(&(obj->dma), &_cyhal_adc_dma_handler, obj);
            cyhal_dma_enable_event(&(obj->dma), CYHAL_DMA_TRANSFER_COMPLETE, dma_priority, true);
        }
#else
        CY_UNUSED_PARAMETER(dma_priority);
        result = CYHAL_ADC_RSLT_BAD_ARGUMENT; // DMA not supported
#endif
    }
    else
    {
#if defined(CY_IP_M0S8CPUSSV3_DMAC) || defined(CY_IP_M4CPUSS_DMA) || defined(CY_IP_M4CPUSS_DMAC)
        /* Free the DMA instances if we reserved them but don't need them anymore */
        if(CYHAL_RSC_INVALID != obj->dma.resource.type)
        {
            cyhal_dma_free(&obj->dma);
            obj->dma.resource.type = CYHAL_RSC_INVALID;
        }
#endif
    }

    if(CY_RSLT_SUCCESS == result)
    {
        obj->async_mode = mode;
    }
    return CY_RSLT_SUCCESS;
}

void cyhal_adc_register_callback(cyhal_adc_t *obj, cyhal_adc_event_callback_t callback, void *callback_arg)
{
    CY_ASSERT(NULL != obj);

    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    obj->callback_data.callback = (cy_israddress) callback;
    obj->callback_data.callback_arg = callback_arg;
    cyhal_system_critical_section_exit(savedIntrStatus);
}

