RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_adc_sar.c
void cyhal_adc_enable_event(cyhal_adc_t *obj, cyhal_adc_event_t event, uint8_t intr_priority, bool enable)
{
    if(enable)
    {
        obj->user_enabled_events |= event;
    }
    else
    {
        obj->user_enabled_events &= ~event;
    }

    _cyhal_adc_update_intr_mask(obj);

    _cyhal_system_irq_t irqn = _cyhal_adc_irq_n[obj->resource.block_num];
    _cyhal_irq_set_priority(irqn, intr_priority);
}

static cyhal_dest_t _cyhal_adc_calculate_dest(uint8_t block_num)
{
    CY_ASSERT(block_num < _CYHAL_ADC_SAR_INSTANCES);
    return _cyhal_adc_tr_in[block_num];
}

static cyhal_source_t _cyhal_adc_calculate_source(uint8_t block_num)
{
    CY_ASSERT(block_num < _CYHAL_ADC_SAR_INSTANCES);
    return _cyhal_adc_tr_out[block_num];
}

cy_rslt_t cyhal_adc_connect_digital(cyhal_adc_t *obj, cyhal_source_t source, cyhal_adc_input_t input)
{
    if(input == CYHAL_ADC_INPUT_START_SCAN)
    {
        Cy_SAR_SetConvertMode(obj->base, CY_SAR_TRIGGER_MODE_FW_AND_HWEDGE);
        cyhal_dest_t dest = _cyhal_adc_calculate_dest(obj->resource.block_num);
#if defined(CY_IP_M0S8PASS4A_SAR_INSTANCES)
        // On M0S8 the trigger type is not configurable so the type argument to connect_signal is ignored
        // Therefore, we arbitrarily pick EDGE to satisfy the interface
        return _cyhal_connect_signal(source, dest);
#else
        return _cyhal_connect_signal(source, dest);
#endif
    }

    return CYHAL_ADC_RSLT_BAD_ARGUMENT;
}

cy_rslt_t cyhal_adc_enable_output(cyhal_adc_t *obj, cyhal_adc_output_t output, cyhal_source_t *source)
{
    if(output == CYHAL_ADC_OUTPUT_SCAN_COMPLETE)
    {
#if defined(CY_IP_M0S8PASS4A_SAR_INSTANCES)
        SAR_SAMPLE_CTRL(obj->base) |= SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_Msk;
#else
        SAR_SAMPLE_CTRL(obj->base) |= SAR_SAMPLE_CTRL_TRIGGER_OUT_EN_Msk;
#endif
        *source = _cyhal_adc_calculate_source(obj->resource.block_num);
        return CY_RSLT_SUCCESS;
    }

    return CYHAL_ADC_RSLT_BAD_ARGUMENT;
}

cy_rslt_t cyhal_adc_disconnect_digital(cyhal_adc_t *obj, cyhal_source_t source,  cyhal_adc_input_t input)
{
    if(input == CYHAL_ADC_INPUT_START_SCAN)
    {
        Cy_SAR_SetConvertMode(obj->base, CY_SAR_TRIGGER_MODE_FW_ONLY);
        cyhal_dest_t dest = _cyhal_adc_calculate_dest(obj->resource.block_num);
        return _cyhal_disconnect_signal(source, dest);
    }

    return CYHAL_ADC_RSLT_BAD_ARGUMENT;
}

cy_rslt_t cyhal_adc_disable_output(cyhal_adc_t *obj, cyhal_adc_output_t output)
{
    if(output != CYHAL_ADC_OUTPUT_SCAN_COMPLETE)
    {
        return CYHAL_ADC_RSLT_BAD_ARGUMENT;
    }

#if defined(CY_IP_M0S8PASS4A_SAR_INSTANCES)
    SAR_SAMPLE_CTRL(obj->base) &= ~SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_Msk;
#else
    SAR_SAMPLE_CTRL(obj->base) &= ~SAR_SAMPLE_CTRL_TRIGGER_OUT_EN_Msk;
#endif

    return CY_RSLT_SUCCESS;
}

#if defined(__cplusplus)
}
#endif

#endif /* (_CYHAL_DRIVER_AVAILABLE_ADC_SAR) */
